STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_lcd.c
  return LCD_OK;
}

/**
  * @brief  Configures and sets the color keying.
  * @param  LayerIndex: Layer foreground or background
  * @param  RGBValue: Color reference
  * @retval None
  */
uint8_t BSP_LCD_SetColorKeying(uint32_t LayerIndex, uint32_t RGBValue)
{
  /* Configure and Enable the color Keying for LCD Layer */
  if(HAL_LTDC_ConfigColorKeying(&hLtdcHandler, RGBValue, LayerIndex) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  if(HAL_LTDC_EnableColorKeying(&hLtdcHandler, LayerIndex) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  return LCD_OK;
}

/**
  * @brief  Configures and sets the color keying without reloading.
  * @param  LayerIndex: Layer foreground or background
  * @param  RGBValue: Color reference
  * @retval None
  */
uint8_t BSP_LCD_SetColorKeying_NoReload(uint32_t LayerIndex, uint32_t RGBValue)
{
  /* Configure and Enable the color Keying for LCD Layer */
  if(HAL_LTDC_ConfigColorKeying_NoReload(&hLtdcHandler, RGBValue, LayerIndex) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  if(HAL_LTDC_EnableColorKeying_NoReload(&hLtdcHandler, LayerIndex) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  return LCD_OK;
}

/**
  * @brief  Disables the color keying.
  * @param  LayerIndex: Layer foreground or background
  * @retval None
  */
uint8_t BSP_LCD_ResetColorKeying(uint32_t LayerIndex)
{
  /* Disable the color Keying for LCD Layer */
  if(HAL_LTDC_DisableColorKeying(&hLtdcHandler, LayerIndex) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  return LCD_OK;
}

/**
  * @brief  Disables the color keying without reloading.
  * @param  LayerIndex: Layer foreground or background
  * @retval None
  */
uint8_t BSP_LCD_ResetColorKeying_NoReload(uint32_t LayerIndex)
{
  /* Disable the color Keying for LCD Layer */
  if(HAL_LTDC_DisableColorKeying_NoReload(&hLtdcHandler, LayerIndex) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  return LCD_OK;
}

/**
  * @brief  Disables the color keying without reloading.
  * @param  ReloadType: can be one of the following values
  *         - LCD_RELOAD_IMMEDIATE
  *         - LCD_RELOAD_VERTICAL_BLANKING
  * @retval None
  */
uint8_t BSP_LCD_Reload(uint32_t ReloadType)
{
  if(HAL_LTDC_Reload (&hLtdcHandler, ReloadType) != HAL_OK)
  {
    return LCD_ERROR;
  }
  
  return LCD_OK;
}

/**
  * @brief  Sets the LCD text color.
  * @param  Color: Text color code ARGB(8-8-8-8)
  * @retval None
  */
void BSP_LCD_SetTextColor(uint32_t Color)
{
  DrawProp[ActiveLayer].TextColor = Color;
}

/**
  * @brief  Gets the LCD text color.
  * @retval Used text color.
  */
uint32_t BSP_LCD_GetTextColor(void)
{
  return DrawProp[ActiveLayer].TextColor;
}

/**
  * @brief  Sets the LCD background color.
  * @param  Color: Layer background color code ARGB(8-8-8-8)
  * @retval None
  */
void BSP_LCD_SetBackColor(uint32_t Color)
{
  DrawProp[ActiveLayer].BackColor = Color;
}

/**
  * @brief  Gets the LCD background color.
  * @retval Used background colour
  */
uint32_t BSP_LCD_GetBackColor(void)
{
  return DrawProp[ActiveLayer].BackColor;
}

/**
  * @brief  Sets the LCD text font.
  * @param  fonts: Layer font to be used
  * @retval None
  */
void BSP_LCD_SetFont(sFONT *fonts)
{
  DrawProp[ActiveLayer].pFont = fonts;
}

/**
  * @brief  Gets the LCD text font.
  * @retval Used layer font
  */
sFONT *BSP_LCD_GetFont(void)
{
  return DrawProp[ActiveLayer].pFont;
}

/**
  * @brief  Enables the display.
  * @retval None
  */
void BSP_LCD_DisplayOn(void)
{
  GPIO_InitTypeDef GPIO_Init_Structure;

  LCD_RST_GPIO_CLK_ENABLE();

  /* Configure the GPIO RST pin */
  GPIO_Init_Structure.Pin   = LCD_RST_PIN;
  GPIO_Init_Structure.Mode  = GPIO_MODE_OUTPUT_PP;
  GPIO_Init_Structure.Pull  = LCD_RST_PULL;
  GPIO_Init_Structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(LCD_RST_GPIO_PORT , &GPIO_Init_Structure);

  /* Activate XRES active low */
  HAL_GPIO_WritePin(LCD_RST_GPIO_PORT , LCD_RST_PIN, GPIO_PIN_RESET);
  HAL_Delay(20);/* wait 20 ms */
  HAL_GPIO_WritePin(LCD_RST_GPIO_PORT , LCD_RST_PIN, GPIO_PIN_SET);/* Deactivate XRES */
  HAL_Delay(10);/* Wait for 10ms after releasing XRES before sending commands */

  GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
  GPIO_Init_Structure.Pin       = LCD_DISP_CTRL_PIN; /* BL_CTRL */
  HAL_GPIO_Init(LCD_DISP_CTRL_GPIO_PORT, &GPIO_Init_Structure);

  /* Assert LCD_DISP_EN pin */
  HAL_GPIO_WritePin(LCD_DISP_CTRL_GPIO_PORT, LCD_DISP_CTRL_PIN, GPIO_PIN_SET);

  /* re-connect the BL pin to the brightness TIMER */
  GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
  GPIO_Init_Structure.Alternate = GPIO_AF1_TIM1;
  GPIO_Init_Structure.Pin       = LCD_BL_CTRL_PIN; /* BL_CTRL */
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_Init_Structure);

  HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);

  /* Display On */
__HAL_LTDC_ENABLE(&hLtdcHandler);

}

/**
  * @brief  Disables the display.
  * @retval None
  */
void BSP_LCD_DisplayOff(void)
{
  GPIO_InitTypeDef GPIO_Init_Structure;

  GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
  GPIO_Init_Structure.Pin       = LCD_DISP_CTRL_PIN; /* BL_CTRL */
  HAL_GPIO_Init(LCD_DISP_CTRL_GPIO_PORT, &GPIO_Init_Structure);

  /* Assert LCD_DISP_EN pin */
  HAL_GPIO_WritePin(LCD_DISP_CTRL_GPIO_PORT, LCD_DISP_CTRL_PIN, GPIO_PIN_RESET);

  /* re-connect the BL pin to the brightness TIMER */
  GPIO_Init_Structure.Mode      = GPIO_MODE_OUTPUT_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_MEDIUM;
  GPIO_Init_Structure.Alternate = GPIO_AF1_TIM1;
  GPIO_Init_Structure.Pin       = LCD_BL_CTRL_PIN; /* BL_CTRL */
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_Init_Structure);

  HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_RESET);

  /* Display Off */
__HAL_LTDC_DISABLE(&hLtdcHandler);

