STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_lcd.c
  /* ('E',  0, AF14) LCD_B5 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_0;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF14_LCD;
  HAL_GPIO_Init(GPIOE, &GPIO_Init_Structure);

  /* ('B',  6, AF7)  LCD_B6 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_6;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF7_USART1;
  HAL_GPIO_Init(GPIOB, &GPIO_Init_Structure);

  /* ('F',  1, AF13) LCD_B7 */
  GPIO_Init_Structure.Pin       = GPIO_PIN_1;
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_NOPULL;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Alternate = GPIO_AF13_LCD;
  HAL_GPIO_Init(GPIOF, &GPIO_Init_Structure);

  /* GIC configuration for LTDC interrupt */
  IRQ_SetPriority(LTDC_IRQn, 0);
  IRQ_Enable(LTDC_IRQn);

  /* Enable LTDC reset state */
__HAL_RCC_LTDC_FORCE_RESET();

  /* Release LTDC from reset state */
__HAL_RCC_LTDC_RELEASE_RESET();

}

/**
  * @brief  DeInitializes BSP_LCD MSP.
  * @param  hltdc: LTDC handle
  * @param  Params
  * @retval None
  */
__weak void BSP_LCD_MspDeInit(LTDC_HandleTypeDef *hltdc, void *Params)
{
   /* Prevent unused argument(s) compilation warning */
    UNUSED(Params);
  
  /* Disable LTDC block */
  __HAL_LTDC_DISABLE(hltdc);
  
  /*
   * CLK  ----> D9  (AF13)
   * HSYNC----> C6  (AF14)
   * VSYNC----> G4  (AF11)
   * DE   ----> H9  (AF11)
   *
   * R2   ----> G7  (AF14)
   * R3   ----> B12 (AF13)
   * R4   ----> D14 (AF14)
   * R5   ----> E7  (AF14)
   * R6   ----> E13 (AF14)
   * R7   ----> E9  (AF14)
   *
   * G2   ----> H3  (AF14)
   * G3   ----> F3  (AF14)
   * G4   ----> D5  (AF14)
   * G5   ----> G0  (AF14)
   * G6   ----> C7  (AF14)
   * G7   ----> A15 (AF11)
   *
   * B2   ----> D10 (AF14)
   * B3   ----> F2  (AF14)
   * B4   ----> H4  (AF11)
   * B5   ----> E0  (AF14)
   * B6   ----> B6  (AF7)
   * B7   ----> F1  (AF13)
   * */

  /* ('D', 9, AF13) LCD_CLK */
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_9);

  /* ('C', 6, AF14) LCD_HSYNC */
  HAL_GPIO_DeInit(GPIOC, GPIO_PIN_6);

  /* ('G',  4, AF11) LCD_VSYNC */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_4);

  /* ('H',  9, AF11) LCD_DE */
  HAL_GPIO_DeInit(GPIOH, GPIO_PIN_9);

  /* ('H',  8, AF13) LCD_R2 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_7);

  /* ('B', 12, AF14) LCD_R3 */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_12);

  /* ('E',  3, AF14) LCD_R4 */
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_4);

  /* ('F',  5, AF14) LCD_R5 */
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_7);

  /* ('C',  6, AF14) LCD_R6 */
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_13);

  /* ('G',  6, AF14) LCD_R7 */
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_9);

  /* ('H', 13, AF14) LCD_G2 */
  HAL_GPIO_DeInit(GPIOH, GPIO_PIN_3);

  /* ('F',  3, AF14) LCD_G3 */
  HAL_GPIO_DeInit(GPIOF, GPIO_PIN_3);

  /* ('G',  5, AF11) LCD_G4 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_5);

  /* ('G',  0, AF14) LCD_G5 */
  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_0);

  /* ('G',  7, AF14) LCD_G6 */
  HAL_GPIO_DeInit(GPIOC, GPIO_PIN_7);

  /* ('A', 15, AF11) LCD_G7 */
  HAL_GPIO_DeInit(GPIOA, GPIO_PIN_15);

  /* ('B',  3, AF14) LCD_B2 */
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_10);

  /* ('F',  2, AF14) LCD_B3 */
  HAL_GPIO_DeInit(GPIOF, GPIO_PIN_2);

  /* ('B',  4, AF14) LCD_B4 */
  HAL_GPIO_DeInit(GPIOH, GPIO_PIN_4);

  /* ('E',  0, AF14) LCD_B5 */
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_0);

  /* ('B',  6, AF7)  LCD_B6 */
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6);

  /* ('F',  1, AF13) LCD_B7 */
  HAL_GPIO_DeInit(GPIOF, GPIO_PIN_1);

  /* Disable IRQ */
  IRQ_Disable(LTDC_IRQn);

  /* Disable LTDC clock */
  __HAL_RCC_LTDC_CLK_DISABLE();

}

/**
  * @brief  Clock Config.
  * @param  hltdc: LTDC handle
  * @param  Params
  * @note   This API is called by BSP_LCD_Init()
  *         Being __weak it can be overwritten by the application
  * @retval None
  */
__weak void BSP_LCD_ClockConfig(LTDC_HandleTypeDef *hltdc, void *Params)
{
   /* Prevent unused argument(s) compilation warning */
  UNUSED(hltdc);
  UNUSED(Params);

  
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */